# Configurazione saved searches con webhook

# # Policy: se ci sono stati dei clients che hanno effettuato più di 10 attacchi (di qualsiasi tipo) in 30 giorni ricevono
# # una diminuzione della fiducia
# [Snort-Attack-Detection-30Days]
# search = | inputlookup known_clients.csv\
#          | join src_ip\
#          [ search index=main sourcetype=snort_alert earliest=-30Days latest=now\
#              | rex field=_raw "(?<src_ip>\d{1,3}(?:\.\d{1,3}){3}):\d+\s+->"\
#              | stats count by src_ip\
#              | where count >= 10\
#          ]\
#          | table src_ip
# dispatch.earliest_time = -30d@d
# dispatch.latest_time = now
# cron_schedule = */2 * * * *
# enableSched = 1
# alert.digest_mode = 0
# alert.suppress = 0
# alert_type = always
# alert.severity = 2
# alert.track = 1
# action.webhook = 1
# action.webhook.param.url = http://pdp:5050/update_trust
# action.webhook.httpmethod = POST


# # Policy: se ci sono degli ip che nell'arco di 30 giorni hanno effettuato più di tot richieste fuori dall'orario di lavoro ricevono una
# # penalità (cambiati ora i dati per testare ma ss corretta)
# [Non-Working-Hours-Detection-More-Than-10-IPs]
# action.webhook = 1
# action.webhook.enable_allowlist = 0
# action.webhook.httpmethod = POST
# action.webhook.param.url = http://pdp:5050/update_trust
# alert.digest_mode = 0
# alert.suppress = 0
# alert.track = 1
# alert_type = always
# counttype = number of events
# cron_schedule = */1 * * * *
# dispatch.earliest_time = -30d@d
# dispatch.latest_time = now
# enableSched = 1
# quantity = 0
# relation = greater than
# search = | inputlookup known_clients.csv\
# | join src_ip [\
#     search index=main sourcetype=squid earliest=-30d@d latest=now\
#     | rex field=_raw "^(?<unixtime>\d+\.\d+)\s+\S+\s+(?<src_ip>\d{1,3}(?:\.\d{1,3}){3})\s"\
#     | eval _time = floor(tonumber(unixtime))\
#     | eval hour = strftime(_time, "%H")\
#     | where hour >= "08" AND hour <= "20"\
#     | stats count AS request_count by src_ip\
#     | where request_count > 5\
# ]\
# | table src_ip request_count


# # Policy "Gli utenti guadagnano 1 punto fiducia ogni 30 giorni di comportamento normale."
# # lanciamo la ss ogni minuto solo per testarla (in condizioni reali ogni 30gg)
# [TrustReputation-Increase]
# search = | inputlookup known_clients.csv\
#          | search NOT [ search index=main sourcetype=snort_alert earliest=-30Days latest=now\
#                | rex field=_raw "(?<src_ip>\d{1,3}(?:\.\d{1,3}){3}):\d+\s+->"\
#                | dedup src_ip\
#                | fields src_ip ]\
#          | table src_ip
# dispatch.earliest_time = -30d@d
# dispatch.latest_time = now
# cron_schedule = */1 * * * *
# enableSched = 1
# alert.digest_mode = 0
# alert.suppress = 0
# alert_type = always
# alert.severity = 2
# alert.track = 1
# action.webhook = 1
# action.webhook.param.url = http://pdp:5050/update_trust
# action.webhook.httpmethod = POST


# Policy "Tutti gli ip (dei client) che negli ultimi 30gg hanno effettuato richieste sospette(DOS) ricevono una riduzione della fiducia"
# la faccio partire ogni 2 min per testarla
# NB i 30gg sono indicativi, da stabilire un tempo adeguato
# [TrustReputation-Decrease]
# search = | inputlookup known_clients.csv\
#          | join src_ip\
#          [ search index=main sourcetype=snort_alert earliest=-30Days latest=now "HTTP POST DoS Detected on PEP /request"\
#              | rex field=_raw "(?<src_ip>\d{1,3}(?:\.\d{1,3}){3}):\d+\s+->"\
#              | dedup src_ip\
#              | fields src_ip\
#          ]\
#          | table src_ip
# dispatch.earliest_time = -30d@d
# dispatch.latest_time = now
# cron_schedule = */2 * * * *
# enableSched = 1
# alert.digest_mode = 0
# alert.suppress = 0
# alert_type = always
# alert.severity = 2
# alert.track = 1
# action.webhook = 1
# action.webhook.param.url = http://pdp:5050/update_trust
# action.webhook.httpmethod = POST


# [PortScanning-HighRate-Detection]
# search = | inputlookup known_clients.csv\
#          | join src_ip\
#          [ search index=main sourcetype=snort_alert earliest=-1m latest=now "Port scanning SYN rilevato su rete 172.24.0.0/24"\
#              | rex field=_raw "(?<src_ip>\d{1,3}(?:\.\d{1,3}){3}):\d+\s+->"\
#              | stats count by src_ip\
#              | where count >= 1\
#          ]\
#          | table src_ip
# dispatch.earliest_time = -1m
# dispatch.latest_time = now
# cron_schedule = */1 * * * *
# enableSched = 1
# alert.digest_mode = 0
# alert.suppress = 0
# alert_type = always
# alert.severity = 2
# alert.track = 1
# action.webhook = 1
# action.webhook.param.url = http://pdp:5050/update_trust
# action.webhook.httpmethod = POST




