# Configurazione saved searches con webhook

[Blacklist-Detection]
search = index=threatintel sourcetype=blacklist | table src_ip
cron_schedule = */10 * * * *
enabled = 1
action.webhook = 1
action.webhook.param.url = http://pdp:5050/update_trust
action.webhook.param.method = POST
action.webhook.param.payload = {"type":"blacklist", "ips": "$result.src_ip$"}

[Snort-Attack-Detection]
search = index=main sourcetype=snort_alerts earliest=-30d@d latest=now | stats count by src_ip | where count > 10
cron_schedule = */10 * * * *
enabled = 1
action.webhook = 1
action.webhook.param.url = http://pdp:5050/update_trust
action.webhook.param.method = POST
action.webhook.param.payload = {"type": "attack", "src_ip": "$result.src_ip$", "count": "$result.count$"}

[Anomalous-Access-Detection]
search = index=main sourcetype=squid (date_hour < 6 OR bytes_out > 10000000) earliest=-30d@d latest=now | stats count by src_ip | where count > 30
cron_schedule = */10 * * * *
enabled = 1
action.webhook = 1
action.webhook.param.url = http://pdp:5050/update_trust
action.webhook.param.method = POST
action.webhook.param.payload = {"type": "anomaly", "src_ip": "$result.src_ip$", "count": "$result.count$"}

[External-Net-Detection]
search = index=main sourcetype=squid | where NOT cidrmatch("172.20.0.0/24", src_ip)
dispatch.earliest_time = -1m
dispatch.latest_time = now
cron_schedule = */1 * * * *
enableSched = 1
alert.digest_mode = 0
alert.suppress = 0
alert_type = always
alert.severity = 3
alert.track = 1
action.webhook = 1
action.webhook.param.url = http://pdp:5050/update_trust
action.webhook.httpmethod = POST