# Configurazione saved searches con webhook

# POLICY 1 (policy 8.2 nel nostro documento)
# Scopo della ricerca
# Identificare IP sorgenti che negli ultimi 7 giorni hanno fatto almeno 10 tentativi di scansione di porte.
# Assegnare loro un punteggio di rischio 25.
# Impostare un’azione di blocco.
# Fornire una motivazione chiara.
# Inviare i risultati al webhook della policy engine (tramite action.webhook) per l’applicazione automatica delle contromisure
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.httpmethod = POST
action.webhook.param.url = http://192.168.200.254:5000/splunk-webhook
action.webhook.url = http://192.168.200.254:5000/splunk-webhook
alert.digest_mode = 0
alert.severity = 2
alert.suppress = 0
alert.track = 1
alert_type = always
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -7d@d
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = index=main sourcetype=snort_alert "Port scan detected" | rex field=_raw "\{(?:TCP|UDP)\}\s+(?<src_ip>\d{1,3}(?:\.\d{1,3}){3}):\d+\s+->" | stats count, max(_time) as last_time by src_ip | where count >= 10 | eval trust_reduction = 25 | eval action = "block" | eval reason = "Multiple port scan attempts in last 30 days" | eval timestamp = strftime(last_time, "%Y-%m-%dT%H:%M:%S") | table timestamp, src_ip, count, trust_reduction, action, reason


[Accesso da reti esterne]
action.webhook = 1
action.webhook.httpmethod = POST
action.webhook.param.url = http://192.168.200.254:5000/splunk-webhook
alert.digest_mode = 0
alert.severity = 2
alert.suppress = 0
alert.track = 1
alert_type = always
cron_schedule = */1 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
search = index=main sourcetype=squid OR sourcetype=snort_alert 
| rex field=_raw "(?<src_ip>\d{1,3}(?:\.\d{1,3}){3})"
| search src_ip="192.168.20.*"
| stats count, max(_time) as last_time by src_ip 
| eval trust_reduction=20 
| eval action="flag" 
| eval reason="Access from external network" 
| eval timestamp=strftime(last_time, "%Y-%m-%dT%H:%M:%S") 
| table timestamp, src_ip, trust_reduction, action, reason
